
# [全职远程] 资深前后端工程师 [20K - 面议] 、开发工程师[15k - 20k]

大家好，我们是房智汇（ HouseSigma Inc.）中国团队。  
我们正在寻找合适的资深前后端工程师 (Staff Engineer/Tech Lead) 和开发工程师 (Development Engineer) 

> 附以前的招聘链接：[https://www.v2ex.com/t/1091416](https://www.v2ex.com/t/1091416),[https://www.v2ex.com/t/1071440](https://www.v2ex.com/t/1071440), [https://www.v2ex.com/t/1039593](https://www.v2ex.com/t/1039593) [https://v2ex.com/t/1021595](https://v2ex.com/t/1021595), [https://v2ex.com/t/945916](https://v2ex.com/t/945916) , [https://v2ex.com/t/853915](https://v2ex.com/t/853915) , [https://v2ex.com/t/827125](https://v2ex.com/t/827125) , [https://www.v2ex.com/t/744848](https://www.v2ex.com/t/744848) , [https://www.v2ex.com/t/398477](https://www.v2ex.com/t/398477) , [https://www.v2ex.com/t/539071](https://www.v2ex.com/t/539071)



### 我们在做什么

房智汇（ [housesigma.com](http://housesigma.com/) ）是位于加拿大多伦多的创业公司，产品是基于大数据和机器学习的房地产投资工具，以便让更多的加拿大人获得更多知识，以做出更好的房地产决策，能够流畅驾驭拥有房屋的每个阶段。我们的核心团队成员位于多伦多， 公司 2016 年获得融资，2017 年发布产品用户和流量高速增长，2018 年开始盈利。现在公司不依赖融资, 有稳定的营收。

### 我们提供什么

- 最舒适的工作地点 – 家里，咖啡店或者其他任何让你可以高效工作的地方
- 自由 – 固定周会之外，可以灵活安排自己的工作进度，工作时间，休息时间
- 最符合技术狂人的工作方式 – 只要工作时登陆语音频道，协作平台
- 职业发展空间 - 涨薪和晋升完全取决于你的个人成长
- 每周 8 x 5 工作，不加班，工资、奖金按时足额发放

### 我们不提供的

- 一天八小时监视你的经理：对不起，我们忙于为用户提供最好的产品，工程师需要有自律能力
- 恶心人的团建：我们默认以发红包代替团建，也鼓励线上线下交流，团建不占用休息时间
- 福报和内卷：我们重视的是效率和质量，我们鼓励分享与合作，不鼓励公司政治

### 我们的主要技术栈

- 后端：PHP 7|8 / Python / Nodejs
- 系统：Centos 8 / Rocky 8 / AWS
- 服务：Mysql / Mongo / Redis / ES / Kafka / K8S
- 前端：Vue / TypeScript / Native iOS|Android
- 沟通：Discord / Zoom|腾讯会议 / ClickUp / Figma

## 资深前后端工程师（ Staff Engineer/Tech Lead ） [20K - 面议]

#### 任职要求：

- 扎实的基础知识，熟悉 Linux 操作系统、存储、网络等相关原理
- 可以独立进行中、大型系统或功能的分析、设计、落地
- 具备较强的分析问题和解决问题的能力
- 思维逻辑清晰，具备良好的沟通能力
- 热爱技术，有探究精神，愿意学习使用新技术

##### 加分项

- 面向 C 端项目主程、架构经验
- 丰富的团队管理经验

#### 工作职责：

- 定义代码风格、可维护性的内部标准，并通过代码审查来维护这些标准
- 负责推动、发布中大规模的功能和改进，并与团队合作完成更大的项目
- 积极寻找阻碍团队效率的困难障碍,提出和实施解决方案
- 为团队中的工程师提供指导，使每个人都能为团队带来新的贡献
- 引领对产品质量、安全性和性能的改进，确保实现可用性目标

---

## 开发工程师 [15k - 20k]

#### 任职要求：

- 扎实的基础知识，了解 Linux 操作系统，一定的英文读写能力；
- 熟练使用 PHP / python语言，熟悉对应生态，了解前端生态；
- 具备较强的分析问题和解决问题的能力；
- 思维逻辑清晰，具备良好的沟通能力；
- 热爱技术，有探究精神，愿意学习使用新技术；

**加分项**

- 做过 C 端项目，并维护开发一年以上

#### 工作职责：

- 编写高质量代码。数据结构清晰、命名规范、遵守模块化原则;
- 对自己工作结果充分测试，确保工作完成质量;
- 解决中小范围内的技术问题;
- 与产品部门合作，在频繁迭代中维持高质量标准;
- 根据项目需要学习新技术，新工具;

---

#### 招聘流程：

- 面试：根据简历内容我们会主观的选择一些候选人，发送面试邀请，通过20分钟的简单交流互相了解，通过后会发送笔试链接
- 笔试：一份远程笔试问卷，需要你在 1 周内完成并反馈回来
- 一轮技术面试：会根据简历和问卷内容，进行第一次交流
- 二轮技术面试：与技术总监进行一次面谈，决定最终的结果

> 我们是个 100% 远程团队，面试从投简历的一刻就已经开始了。请尽量保持文字格式工整，因为每份简历和问卷我们都会认真阅读，希望大家理解。本次招聘过程可能会持续 1-2 个月，进度会持续在此更新，直至完成。以往的招聘我们都尽量回复了每一位候选者，但是难免有疏漏，放心来信催问

#### 简历请投：

```plain
To: hr-china@housesigma.com
Subject: V2EX 招聘  [申请人姓名，申请岗位，所在城市] 

请说明:
- 您的基础情况
- 预计的入职时间
- 预期的薪资
- 附件简历，最好是 PDF 的

微信 / 手机 联络方式之一
如果有 github ，portfolio 请随简历提供
```

#### 注意：

- 公司目前没有国内的主体，所以社保需要自己缴纳；
- 薪酬可能更适合在老家的朋友，的确比不上大城市，但能力优秀者，可以谈；
- 如有任何疑问，可以留言或者来信，我会尽快解答；
